espressif/esp-idf/components/soc/esp32/include/soc/spi_struct.h
            uint32_t bit_len:    24;                        /*In the slave mode it is the length in bits for read-buffer operations. The register value shall be (bit_num-1).*/
            uint32_t reserved24:  8;                        /*reserved*/
        };
        uint32_t val;
    } slv_rdbuf_dlen;
    union {
        struct {
            uint32_t req_en:        1;                      /*For SPI0  Cache access enable  1: enable  0:disable.*/
            uint32_t usr_cmd_4byte: 1;                      /*For SPI0  cache  read flash with 4 bytes command  1: enable  0:disable.*/
            uint32_t flash_usr_cmd: 1;                      /*For SPI0  cache  read flash for user define command  1: enable  0:disable.*/
            uint32_t flash_pes_en:  1;                      /*For SPI0  spi1 send suspend command before cache read flash  1: enable  0:disable.*/
            uint32_t reserved4:    28;                      /*reserved*/
        };
        uint32_t val;
    } cache_fctrl;
    union {
        struct {
            uint32_t reserved0:           1;                /*reserved*/
            uint32_t usr_sram_dio:        1;                /*For SPI0  In the spi sram mode  spi dual I/O mode enable  1: enable  0:disable*/
            uint32_t usr_sram_qio:        1;                /*For SPI0  In the spi sram mode  spi quad I/O mode enable  1: enable  0:disable*/
            uint32_t usr_wr_sram_dummy:   1;                /*For SPI0  In the spi sram mode  it is the enable bit of dummy phase for write operations.*/
            uint32_t usr_rd_sram_dummy:   1;                /*For SPI0  In the spi sram mode  it is the enable bit of dummy phase for read operations.*/
            uint32_t cache_sram_usr_rcmd: 1;                /*For SPI0  In the spi sram mode cache read sram for user define command.*/
            uint32_t sram_bytes_len:      8;                /*For SPI0  In the sram mode  it is the byte length of spi read sram data.*/
            uint32_t sram_dummy_cyclelen: 8;                /*For SPI0  In the sram mode  it is the length in bits of address phase. The register value shall be (bit_num-1).*/
            uint32_t sram_addr_bitlen:    6;                /*For SPI0  In the sram mode  it is the length in bits of address phase. The register value shall be (bit_num-1).*/
            uint32_t cache_sram_usr_wcmd: 1;                /*For SPI0  In the spi sram mode cache write sram for user define command*/
            uint32_t reserved29:          3;                /*reserved*/
        };
        uint32_t val;
    } cache_sctrl;
    union {
        struct {
            uint32_t dio:       1;                          /*For SPI0 SRAM DIO mode enable .  SRAM DIO enable command will be send when the bit is set. The bit will be cleared once the operation done.*/
            uint32_t qio:       1;                          /*For SPI0 SRAM QIO mode enable .  SRAM QIO enable command will be send when the bit is set. The bit will be cleared once the operation done.*/
            uint32_t reserved2: 2;                          /*For SPI0 SRAM write enable . SRAM write operation will be triggered when the bit is set. The bit will be cleared once the operation done.*/
            uint32_t rst_io:    1;                          /*For SPI0 SRAM IO mode reset enable. SRAM IO mode reset operation will be triggered when the bit is set. The bit will be cleared once the operation done*/
            uint32_t reserved5:27;                          /*reserved*/
        };
        uint32_t val;
    } sram_cmd;
    union {
        struct {
            uint32_t usr_rd_cmd_value:   16;                /*For SPI0 When cache mode is enable it is the read command value of command phase for SRAM.*/
            uint32_t reserved16:         12;                /*reserved*/
            uint32_t usr_rd_cmd_bitlen:   4;                /*For SPI0 When cache mode is enable it is the length in bits of command phase for SRAM. The register value shall be (bit_num-1).*/
        };
        uint32_t val;
    } sram_drd_cmd;
    union {
        struct {
            uint32_t usr_wr_cmd_value: 16;                  /*For SPI0 When cache mode is enable it is the write command value of command phase for SRAM.*/
            uint32_t reserved16:       12;                  /*reserved*/
            uint32_t usr_wr_cmd_bitlen: 4;                  /*For SPI0 When cache mode is enable it is the in bits of command phase  for SRAM. The register value shall be (bit_num-1).*/
        };
        uint32_t val;
    } sram_dwr_cmd;
    union {
        struct {
            uint32_t slv_rdata_bit:24;                      /*In the slave mode it is the bit length of read data. The value is the length - 1.*/
            uint32_t reserved24:    8;                      /*reserved*/
        };
        uint32_t val;
    } slv_rd_bit;
    uint32_t reserved_68;
    uint32_t reserved_6c;
    uint32_t reserved_70;
    uint32_t reserved_74;
    uint32_t reserved_78;
    uint32_t reserved_7c;
    uint32_t data_buf[16];                                  /*data buffer*/
    uint32_t tx_crc;                                        /*For SPI1  the value of crc32 for 256 bits data.*/
    uint32_t reserved_c4;
    uint32_t reserved_c8;
    uint32_t reserved_cc;
    uint32_t reserved_d0;
    uint32_t reserved_d4;
    uint32_t reserved_d8;
    uint32_t reserved_dc;
    uint32_t reserved_e0;
    uint32_t reserved_e4;
    uint32_t reserved_e8;
    uint32_t reserved_ec;
    union {
        struct {
            uint32_t t_pp_time: 12;                         /*page program delay time  by system clock.*/
            uint32_t reserved12: 4;                         /*reserved*/
            uint32_t t_pp_shift: 4;                         /*page program delay time shift .*/
            uint32_t reserved20:11;                         /*reserved*/
            uint32_t t_pp_ena:   1;                         /*page program delay enable.*/
        };
        uint32_t val;
    } ext0;
    union {
        struct {
            uint32_t t_erase_time: 12;                      /*erase flash delay time by system clock.*/
            uint32_t reserved12:    4;                      /*reserved*/
            uint32_t t_erase_shift: 4;                      /*erase flash delay time shift.*/
            uint32_t reserved20:   11;                      /*reserved*/
            uint32_t t_erase_ena:   1;                      /*erase flash delay enable.*/
        };
        uint32_t val;
    } ext1;
    union {
        struct {
            uint32_t st:         3;                         /*The status of spi state machine .*/
            uint32_t reserved3: 29;                         /*reserved*/
        };
        uint32_t val;
    } ext2;
    union {
        struct {
            uint32_t int_hold_ena: 2;                       /*This register is for two SPI masters to share the same cs clock and data signals. The bits of one SPI are set  if the other SPI is busy  the SPI will be hold. 1(3): hold at ,idle, phase 2: hold at ,prepare, phase.*/
            uint32_t reserved2:   30;                       /*reserved*/
        };
        uint32_t val;
    } ext3;
    union {
        struct {
            uint32_t reserved0:         2;                  /*reserved*/
            uint32_t in_rst:            1;                  /*The bit is used to reset in dma fsm and in data fifo pointer.*/
            uint32_t out_rst:           1;                  /*The bit is used to reset out dma fsm and out data fifo pointer.*/
            uint32_t ahbm_fifo_rst:     1;                  /*reset spi dma ahb master fifo pointer.*/
            uint32_t ahbm_rst:          1;                  /*reset spi dma ahb master.*/
            uint32_t in_loop_test:      1;                  /*Set bit to test in link.*/
            uint32_t out_loop_test:     1;                  /*Set bit to test out link.*/
            uint32_t out_auto_wrback:   1;                  /*when the link is empty   jump to next automatically.*/
            uint32_t out_eof_mode:      1;                  /*out eof flag generation mode . 1: when dma pop all data from fifo  0:when ahb push all data to fifo.*/
            uint32_t outdscr_burst_en:  1;                  /*read descriptor use burst mode when read data for memory.*/
            uint32_t indscr_burst_en:   1;                  /*read descriptor use burst mode when write data to memory.*/
            uint32_t out_data_burst_en: 1;                  /*spi dma read data from memory in burst mode.*/
            uint32_t reserved13:        1;                  /*reserved*/
            uint32_t dma_rx_stop:       1;                  /*spi dma read data stop  when in continue tx/rx mode.*/
            uint32_t dma_tx_stop:       1;                  /*spi dma write data stop when in continue tx/rx mode.*/
            uint32_t dma_continue:      1;                  /*spi dma continue tx/rx data.*/
            uint32_t reserved17:       15;                  /*reserved*/
        };
        uint32_t val;
    } dma_conf;
    union {
        struct {
            uint32_t addr:        20;                       /*The address of the first outlink descriptor.*/
            uint32_t reserved20:   8;                       /*reserved*/
            uint32_t stop:         1;                       /*Set the bit to stop to use outlink descriptor.*/
            uint32_t start:        1;                       /*Set the bit to start to use outlink descriptor.*/
            uint32_t restart:      1;                       /*Set the bit to mount on new outlink descriptors.*/
            uint32_t reserved31:   1;                       /*reserved*/
        };
        uint32_t val;
    } dma_out_link;
    union {
        struct {
            uint32_t addr:       20;                        /*The address of the first inlink descriptor.*/
            uint32_t auto_ret:    1;                        /*when the bit is set  inlink descriptor returns to the next descriptor while a packet is wrong*/
            uint32_t reserved21:  7;                        /*reserved*/
            uint32_t stop:        1;                        /*Set the bit to stop to use inlink descriptor.*/
            uint32_t start:       1;                        /*Set the bit to start to use inlink descriptor.*/
            uint32_t restart:     1;                        /*Set the bit to mount on new inlink descriptors.*/
            uint32_t reserved31:  1;                        /*reserved*/
        };
        uint32_t val;
    } dma_in_link;
    union {
        struct {
            uint32_t rx_en:      1;                         /*spi dma read data status bit.*/
            uint32_t tx_en:      1;                         /*spi dma write data status bit.*/
            uint32_t reserved2: 30;                         /*spi dma read data from memory count.*/
        };
        uint32_t val;
    } dma_status;
    union {
        struct {
            uint32_t inlink_dscr_empty:  1;                 /*The enable bit for lack of enough inlink descriptors.*/
            uint32_t outlink_dscr_error: 1;                 /*The enable bit for outlink descriptor error.*/
            uint32_t inlink_dscr_error:  1;                 /*The enable bit for inlink descriptor error.*/
            uint32_t in_done:            1;                 /*The enable bit for completing usage of a inlink descriptor.*/
            uint32_t in_err_eof:         1;                 /*The enable bit for receiving error.*/
            uint32_t in_suc_eof:         1;                 /*The enable bit for completing receiving all the packets from host.*/
            uint32_t out_done:           1;                 /*The enable bit for completing usage of a outlink descriptor .*/
            uint32_t out_eof:            1;                 /*The enable bit for sending a packet to host done.*/
            uint32_t out_total_eof:      1;                 /*The enable bit for sending all the packets to host done.*/
            uint32_t reserved9:         23;                 /*reserved*/
        };
        uint32_t val;
    } dma_int_ena;
    union {
        struct {
            uint32_t inlink_dscr_empty:  1;                 /*The raw bit for lack of enough inlink descriptors.*/
            uint32_t outlink_dscr_error: 1;                 /*The raw bit for outlink descriptor error.*/
            uint32_t inlink_dscr_error:  1;                 /*The raw bit for inlink descriptor error.*/
            uint32_t in_done:            1;                 /*The raw bit for completing usage of a inlink descriptor.*/
            uint32_t in_err_eof:         1;                 /*The raw bit for receiving error.*/
            uint32_t in_suc_eof:         1;                 /*The raw bit for completing receiving all the packets from host.*/
            uint32_t out_done:           1;                 /*The raw bit for completing usage of a outlink descriptor.*/
            uint32_t out_eof:            1;                 /*The raw bit for sending a packet to host done.*/
            uint32_t out_total_eof:      1;                 /*The raw bit for sending all the packets to host done.*/
            uint32_t reserved9:         23;                 /*reserved*/
        };
        uint32_t val;
    } dma_int_raw;
    union {
        struct {
            uint32_t inlink_dscr_empty:  1;                  /*The status bit for lack of enough inlink descriptors.*/
            uint32_t outlink_dscr_error: 1;                  /*The status bit for outlink descriptor error.*/
            uint32_t inlink_dscr_error:  1;                  /*The status bit for inlink descriptor error.*/
            uint32_t in_done:            1;                  /*The status bit for completing usage of a inlink descriptor.*/
            uint32_t in_err_eof:         1;                  /*The status bit for receiving error.*/
            uint32_t in_suc_eof:         1;                  /*The status bit for completing receiving all the packets from host.*/
            uint32_t out_done:           1;                  /*The status bit for completing usage of a outlink descriptor.*/
            uint32_t out_eof:            1;                  /*The status bit for sending a packet to host done.*/
            uint32_t out_total_eof:      1;                  /*The status bit for sending all the packets to host done.*/
            uint32_t reserved9:         23;                  /*reserved*/
        };
        uint32_t val;
    } dma_int_st;
    union {
        struct {
            uint32_t inlink_dscr_empty:  1;                 /*The clear bit for lack of enough inlink descriptors.*/
            uint32_t outlink_dscr_error: 1;                 /*The clear bit for outlink descriptor error.*/
            uint32_t inlink_dscr_error:  1;                 /*The clear bit for inlink descriptor error.*/
            uint32_t in_done:            1;                 /*The clear bit for completing usage of a inlink descriptor.*/
            uint32_t in_err_eof:         1;                 /*The clear bit for receiving error.*/
            uint32_t in_suc_eof:         1;                 /*The clear bit for completing receiving all the packets from host.*/
            uint32_t out_done:           1;                 /*The clear bit for completing usage of a outlink descriptor.*/
            uint32_t out_eof:            1;                 /*The clear bit for sending a packet to host done.*/
            uint32_t out_total_eof:      1;                 /*The clear bit for sending all the packets to host done.*/
            uint32_t reserved9:         23;                 /*reserved*/
        };
        uint32_t val;
    } dma_int_clr;
    uint32_t dma_in_err_eof_des_addr;                       /*The inlink descriptor address when spi dma produce receiving error.*/
    uint32_t dma_in_suc_eof_des_addr;                       /*The last inlink descriptor address when spi dma produce from_suc_eof.*/
    uint32_t dma_inlink_dscr;                               /*The content of current in descriptor pointer.*/
    uint32_t dma_inlink_dscr_bf0;                           /*The content of next in descriptor pointer.*/
    uint32_t dma_inlink_dscr_bf1;                           /*The content of current in descriptor data buffer pointer.*/
    uint32_t dma_out_eof_bfr_des_addr;                      /*The address of buffer relative to the outlink descriptor that produce eof.*/
    uint32_t dma_out_eof_des_addr;                          /*The last outlink descriptor address when spi dma produce to_eof.*/
    uint32_t dma_outlink_dscr;                              /*The content of current out descriptor pointer.*/
    uint32_t dma_outlink_dscr_bf0;                          /*The content of next out descriptor pointer.*/
    uint32_t dma_outlink_dscr_bf1;                          /*The content of current out descriptor data buffer pointer.*/
    uint32_t dma_rx_status;                                 /*spi dma read data from memory status.*/
    uint32_t dma_tx_status;                                 /*spi dma write data to memory status.*/
    uint32_t reserved_150;
    uint32_t reserved_154;
    uint32_t reserved_158;
    uint32_t reserved_15c;
    uint32_t reserved_160;
    uint32_t reserved_164;
    uint32_t reserved_168;
    uint32_t reserved_16c;
    uint32_t reserved_170;
    uint32_t reserved_174;
    uint32_t reserved_178;
    uint32_t reserved_17c;
    uint32_t reserved_180;
    uint32_t reserved_184;
    uint32_t reserved_188;
    uint32_t reserved_18c;
    uint32_t reserved_190;
    uint32_t reserved_194;
    uint32_t reserved_198;
    uint32_t reserved_19c;
    uint32_t reserved_1a0;
    uint32_t reserved_1a4;
    uint32_t reserved_1a8;
    uint32_t reserved_1ac;
    uint32_t reserved_1b0;
    uint32_t reserved_1b4;
    uint32_t reserved_1b8;
    uint32_t reserved_1bc;
    uint32_t reserved_1c0;
    uint32_t reserved_1c4;
    uint32_t reserved_1c8;
    uint32_t reserved_1cc;
    uint32_t reserved_1d0;
    uint32_t reserved_1d4;
    uint32_t reserved_1d8;
    uint32_t reserved_1dc;
    uint32_t reserved_1e0;
    uint32_t reserved_1e4;
    uint32_t reserved_1e8;
    uint32_t reserved_1ec;
    uint32_t reserved_1f0;
    uint32_t reserved_1f4;
    uint32_t reserved_1f8;
    uint32_t reserved_1fc;
    uint32_t reserved_200;
    uint32_t reserved_204;
    uint32_t reserved_208;
    uint32_t reserved_20c;
    uint32_t reserved_210;
    uint32_t reserved_214;
    uint32_t reserved_218;
    uint32_t reserved_21c;
    uint32_t reserved_220;
    uint32_t reserved_224;
    uint32_t reserved_228;
    uint32_t reserved_22c;
    uint32_t reserved_230;
    uint32_t reserved_234;
    uint32_t reserved_238;
    uint32_t reserved_23c;
    uint32_t reserved_240;
    uint32_t reserved_244;
    uint32_t reserved_248;
    uint32_t reserved_24c;
    uint32_t reserved_250;
    uint32_t reserved_254;
    uint32_t reserved_258;
    uint32_t reserved_25c;
    uint32_t reserved_260;
    uint32_t reserved_264;
    uint32_t reserved_268;
    uint32_t reserved_26c;
    uint32_t reserved_270;
    uint32_t reserved_274;
    uint32_t reserved_278;
    uint32_t reserved_27c;
    uint32_t reserved_280;
    uint32_t reserved_284;
    uint32_t reserved_288;
    uint32_t reserved_28c;
    uint32_t reserved_290;
    uint32_t reserved_294;
    uint32_t reserved_298;
    uint32_t reserved_29c;
    uint32_t reserved_2a0;
    uint32_t reserved_2a4;
    uint32_t reserved_2a8;
    uint32_t reserved_2ac;
    uint32_t reserved_2b0;
    uint32_t reserved_2b4;
    uint32_t reserved_2b8;
    uint32_t reserved_2bc;
    uint32_t reserved_2c0;
    uint32_t reserved_2c4;
    uint32_t reserved_2c8;
    uint32_t reserved_2cc;
    uint32_t reserved_2d0;
    uint32_t reserved_2d4;
    uint32_t reserved_2d8;
    uint32_t reserved_2dc;
    uint32_t reserved_2e0;
    uint32_t reserved_2e4;
    uint32_t reserved_2e8;
    uint32_t reserved_2ec;
    uint32_t reserved_2f0;
    uint32_t reserved_2f4;
    uint32_t reserved_2f8;
    uint32_t reserved_2fc;
    uint32_t reserved_300;
    uint32_t reserved_304;
    uint32_t reserved_308;
    uint32_t reserved_30c;
    uint32_t reserved_310;
    uint32_t reserved_314;
    uint32_t reserved_318;
    uint32_t reserved_31c;
    uint32_t reserved_320;
    uint32_t reserved_324;
    uint32_t reserved_328;
    uint32_t reserved_32c;
    uint32_t reserved_330;
    uint32_t reserved_334;
    uint32_t reserved_338;
    uint32_t reserved_33c;
    uint32_t reserved_340;
    uint32_t reserved_344;
    uint32_t reserved_348;
    uint32_t reserved_34c;
    uint32_t reserved_350;
    uint32_t reserved_354;
    uint32_t reserved_358;
    uint32_t reserved_35c;
    uint32_t reserved_360;
    uint32_t reserved_364;
    uint32_t reserved_368;
    uint32_t reserved_36c;
    uint32_t reserved_370;
    uint32_t reserved_374;
    uint32_t reserved_378;
    uint32_t reserved_37c;
    uint32_t reserved_380;
    uint32_t reserved_384;
    uint32_t reserved_388;
    uint32_t reserved_38c;
    uint32_t reserved_390;
    uint32_t reserved_394;
    uint32_t reserved_398;
    uint32_t reserved_39c;
    uint32_t reserved_3a0;
    uint32_t reserved_3a4;
    uint32_t reserved_3a8;
    uint32_t reserved_3ac;
    uint32_t reserved_3b0;
    uint32_t reserved_3b4;
    uint32_t reserved_3b8;
    uint32_t reserved_3bc;
    uint32_t reserved_3c0;
    uint32_t reserved_3c4;
    uint32_t reserved_3c8;
    uint32_t reserved_3cc;
    uint32_t reserved_3d0;
    uint32_t reserved_3d4;
    uint32_t reserved_3d8;
    uint32_t reserved_3dc;
    uint32_t reserved_3e0;
    uint32_t reserved_3e4;
    uint32_t reserved_3e8;
    uint32_t reserved_3ec;
    uint32_t reserved_3f0;
    uint32_t reserved_3f4;
    uint32_t reserved_3f8;
    union {
        struct {
            uint32_t date:      28;                         /*SPI register version.*/
            uint32_t reserved28: 4;                         /*reserved*/
        };
        uint32_t val;
    } date;
} spi_dev_t;
#ifdef __cplusplus
extern "C" {
#endif
extern spi_dev_t SPI0;                                      /* SPI0 IS FOR INTERNAL USE*/
extern spi_dev_t SPI1;
extern spi_dev_t SPI2;
extern spi_dev_t SPI3;
#ifdef __cplusplus
}
#endif
#endif  /* _SOC_SPI_STRUCT_H_ */
